-- phpMyAdmin SQL Dump
-- version 4.7.7
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Час створення: Квт 01 2018 р., 14:17
-- Версія сервера: 5.6.38
-- Версія PHP: 7.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `mybase`
--

-- --------------------------------------------------------

--
-- Структура таблиці `publication`
--

CREATE TABLE `publication` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `short_content` text NOT NULL,
  `content` text NOT NULL,
  `author_name` varchar(255) NOT NULL,
  `preview` varchar(255) NOT NULL,
  `type` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп даних таблиці `publication`
--

INSERT INTO `publication` (`id`, `title`, `date`, `short_content`, `content`, `author_name`, `preview`, `type`) VALUES
(1, 'Дивіться \"Вєсті Кремля\". Комуністичний Дон Кіхот. Хто вкрав вікна у росіян', '2018-03-07 18:09:50', 'Сьогодні у програмі \"Вєсті Кремля\" – після того, як Ксенія Собчак вирішила стати кандидатом в президенти їй не позаздриш: друзі відвернулись, а вороги всіляко намагаються образити. Але на допомогу білявці прийшов комуніст Грудінін. В природі зустріти будинок без вікон і дверей практично нереально. Звісно, якщо ти не живеш в Росії.\r\n', '', 'Ярослав Стригун', '/images/1.jpg', 'NewsPublication'),
(2, 'В Україні на нас не звертали уваги, не бачили перспектив, – фігурист, який переїхав в Ізраїль', '2018-03-07 18:11:55', 'Олексій Биченко – український фігурист, який представляє Ізраїль. Цій країні він приніс срібло чемпіонату Європи-2016, став 11-м на Олімпіаді-2018 у Пхьончхані. Спортсмен народився і виріс у Києві. Якби залишився в Україні, то фігурне катання закінчилося б для нього років дев\'ять тому. В Ізраїль Олексій подався не за грішми. А тому, що вдома його талантом банально знехтували.', '', 'Вася Пупок', '/images/2.jpg', 'NewsPublication'),
(3, '8 березня: яка справжня історія цього свята – Клара Цеткін, євреї та повії', '2018-03-07 18:14:43', '8 березня в Україні щороку святкують сотні тисяч жінок. Однак пояснити, чому ми святуємо Жіночий день саме 8 березня та яка взагалі історія цього свята – не так вже й просто. Як \"повій\" в історії замінили на \"трудящих\" та до чого тут євреї – читайте в матеріалі.\r\n', '', 'Петро Шнирь', '/images/3.jpg', 'ArticlePublication'),
(4, 'Комбаров грубо порушив принципи \"чесної гри\" у матчі РФПЛу', '2018-03-07 18:17:26', 'Тульський Арсенал вирвав перемогу на 90+1 хвилині матчу завдяки голу Горана Чаушіча, який був забитий з порушенням принципів фейр-плей. Після того, як захисник Ахмата Олег Іванов травмувався у зіткненні зі своїм же партнером по команді Міладом Мохаммаді, оборонець Арсенала Кирило Комбаров продовжив гру та виконав гольову передачу.\r\n', '', 'Олег Хряк', '/images/4.jpg', 'ArticlePublication'),
(5, 'Гурт \"Ленінград\" презентував кліп \"Не Париж\" до 8 березня', '2018-03-07 18:20:23', '7 березня російський гурт \"Ленінград\" презентувала кліп на пісню \"Не Париж\", який активно обговорюють користувачі мережі. Менш ніж за добу кліп встигнули переглянути понад мільйон разів.\r\n', '', 'Анжела Оресь', '/images/5.jpg', 'PhotoReportPublication');

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `publication`
--
ALTER TABLE `publication`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `publication`
--
ALTER TABLE `publication`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
